#pragma once

/*
	Для удобства работы с элементами списка, определите еще один класс, который будет
	содержать данные одного элемента списка. В итоге у вас будет два класса:
		 класс с данными, объект которого представляет собой строку данных таблицы. К
		примеру, если бы у вас в программе был список студентов, то этот класс отражал бы
		данные одного студента.
		 класс списка, объект которого представляет сам список. Он использует объекты
		класса с данными как элементы списка.
	Добавьте конструктор копирования для класса с данными. Также добавьте метод в класс
	списка позволяющий выполнять сортировку списка по какому-либо принципу
*/

void additionalTask();