#pragma once

/*	
	Создать класс типа «прямоугольник». Поля – высота и ширина. Сделайте поля недоступными
	вне класса (private). Методы класса должны вычислять площадь, периметр, устанавливать поля и
	возвращать значения полей. Создать конструкторы: пустой (определить значения по умолчанию) и
	с параметрами. Методы установки полей класса должны проверять корректность задаваемых
	параметров (к примеру, не устанавливать отрицательные значения). В случае передачи в метод
	некорректных данных, не менять значение на новое. Организовать работу с этим классом в
	функции main() для демонстрации.
*/

void firstGeneralTask();