#pragma once

/*	
	Создать класс, описывающий данные человека (типа Person). Поля – имя, фамилия, отчество,
	возраст и пол. Строки должны быть представлены как символьные массивы, выделять под них
	память динамически.
	Создать конструкторы: пустой (определить значения по умолчанию), с параметрами и
	конструктор копирования.
	Создать деструктор для освобождения выделенной памяти.
	Создать метод для вывода данных полей класса в консоль.
	Организовать работу с этим классом в функции main() для демонстрации
*/

void secondGeneralTask();